Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильПолномочийПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПолномочийПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистПоУпаковке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросмотрВсехМагазиновВНовойВкусвилл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АК_ВнутренийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентАутсорсинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСотрудниковАутсорсинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСотрудниковАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьЗаданияПоЗаявкамНаРасходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноУдалениеТоварныхОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодчиненныеПользователи</Name>
					<Comment>пока что это сделано для установки границ запрета, возможно потом расширится</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПолномочийПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РолиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РолиПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРолейПользователейМОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик_СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расчетчики</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРолиСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЛентыКартинок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставРоли</Name>
					<Comment>Сотрудники, входящие в роль в данной ИБ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураХарактеристика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыРолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипРоли</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставТранспортРазвоз</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Откуда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куда</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРозничныхТочек</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобытияАвторассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СобытияАвторассылкиМОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассылатьДочернимРолям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРакурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ракурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МП_Ракурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Ext/ManagerModule.bsl
Процедура КопироватьНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Записать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = НаборНастроек.Добавить();
		Запись.Пользователь = Приемник;
		Запись.Настройка = ВыборкаДетальныеЗаписи.Настройка;
		Если ВыборкаДетальныеЗаписи.Настройка=ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный Тогда
			Запись.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(Приемник);
		Иначе	
			Запись.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
		КонецЕсли; 
	КонецЦикла;

	
	НаборНастроек.Записать();
	

КонецПроцедуры

Процедура ОбъединитьНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
			Фл=Ложь;
			Для каждого Зап Из НаборНастроек Цикл
				Если Зап.Настройка = ВыборкаДетальныеЗаписи.Настройка Тогда
					Зап.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
					Фл=истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			Если Не Фл Тогда
				Запись = НаборНастроек.Добавить();
				Запись.Пользователь = Приемник;
				Запись.Настройка = ВыборкаДетальныеЗаписи.Настройка;
				Запись.Значение = ВыборкаДетальныеЗаписи.Настройка.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;

	
	НаборНастроек.Записать();
	

КонецПроцедуры


Процедура КопироватьФункциональныеРоли(Источник,Приемник) Экспорт
 
	ТЗ = "ВЫБРАТЬ
	     |	РолиПользователейТипыРолей.Ссылка как ТипРоли
	     |ИЗ
	     |	Справочник.РолиПользователей КАК РолиПользователейТипыРолей";
		 
	//
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.Текст = ТЗ;
	
	
	//
	Выборка = ПЗ.Результат.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		МасСтр=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Источник.ФизЛицо));
		МасСтрПриемник=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Приемник.ФизЛицо));
		Если Не МасСтр.Количество()=0 и МасСтрПриемник.Количество()=0 Тогда                             
			ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
			НовСтр=ОбРоль.СоставРоли.Добавить();
			НовСтр.Сотрудник=Приемник.ФизЛицо;
			ОбРоль.Записать();
		КонецЕсли;                       
		Если МасСтр.Количество()=0 и Не МасСтрПриемник.Количество()=0 Тогда                             
			ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
			ОбРоль.СоставРоли.Удалить(МасСтрПриемник[0].НомерСтроки-1);
			ОбРоль.Записать();
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

Процедура ОбъединитьФункциональныеРоли(Источник,Приемник) Экспорт
 
	ТЗ = "ВЫБРАТЬ
	     |	РолиПользователейТипыРолей.Ссылка как ТипРоли
	     |ИЗ
	     |	Справочник.РолиПользователей КАК РолиПользователейТипыРолей";
		 
	//
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.Текст = ТЗ;
	
	
	//
	Выборка = ПЗ.Результат.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		МасСтр=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Источник.ФизЛицо));
		МасСтрПриемник=Выборка.ТипРоли.СоставРоли.НайтиСтроки(Новый Структура("Сотрудник",Приемник.ФизЛицо));
		Если Не МасСтр.Количество()=0 и МасСтрПриемник.Количество()=0 Тогда                             
			ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
			НовСтр=ОбРоль.СоставРоли.Добавить();
			НовСтр.Сотрудник=Приемник.ФизЛицо;
			ОбРоль.Записать();
		КонецЕсли;                       
		//Если МасСтр.Количество()=0 и Не МасСтрПриемник.Количество()=0 Тогда                             
		//	ОбРоль=Выборка.ТипРоли.ПолучитьОбъект();
		//	ОбРоль.СоставРоли.Удалить(МасСтрПриемник[0].НомерСтроки-1);
		//	ОбРоль.Записать();
		//КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

Процедура КопироватьДопНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Право,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Записать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = НаборНастроек.Добавить();
		Запись.Пользователь = Приемник;
		Запись.Право = ВыборкаДетальныеЗаписи.Право;
		Запись.Значение = ВыборкаДетальныеЗаписи.Право.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;

	
	НаборНастроек.Записать();
	

КонецПроцедуры

Процедура ОбъединитьДопНастройки(Источник,Приемник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Пользователь,
		|	НастройкиПользователей.Право,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхПравПользователя КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Источник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	НаборНастроек = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Пользователь.Установить(Приемник);
	НаборНастроек.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
			Фл=Ложь;
			Для каждого Зап Из НаборНастроек Цикл
				Если Зап.Право = ВыборкаДетальныеЗаписи.Право Тогда
					Зап.Значение = ВыборкаДетальныеЗаписи.Право.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
					Фл=истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла;
			Если Не Фл Тогда
				Запись = НаборНастроек.Добавить();
				Запись.Пользователь = Приемник;
				Запись.Право = ВыборкаДетальныеЗаписи.Право;
				Запись.Значение = ВыборкаДетальныеЗаписи.Право.ТипЗначения.ПривестиЗначение(ВыборкаДетальныеЗаписи.Значение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;


	
	НаборНастроек.Записать();
	

КонецПроцедуры
